TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
// include/ui/ui_manager.h — top-level LVGL orchestration: display/touch
// init, owns one instance of each of the 5 screen classes, wires their
// shared header/footer taps (logo -> home, date -> calendar, QR -> config),
// and handles horizontal swipe navigation between them.
//
// Each screen's own visual structure lives in its dedicated header
// (screen_turbo.h, screen_debt.h, screen_game.h, screen_node.h) plus the
// Clock screen built inline below (kept as the original reference pattern).
//
// HARDWARE BRING-UP (initDisplayAndTouch):
//   Fully implemented based on Seeed's reference firmware:
//     github.com/Seeed-Solution/SenseCAP_Indicator_ESP32
//   The sequence is:
//     1. I2C bus init (SDA=39, SCL=40, shared by TCA9535 + FT6336U)
//     2. TCA9535 IO expander config (LCD_CS, LCD_RST, TP_RST as outputs)
//     3. ST7701S panel reset + 9-bit SPI init sequence (GPIO 41/48 bit-bang)
//     4. FT6336U touch reset (via expander) + LVGL input driver registration
//     5. RGB panel creation via esp_lcd_new_rgb_panel() (requires IDF 5.x /
//        Arduino-ESP32 3.x -- see platformio.ini's espressif32@^6.0.0)
//     6. Backlight enable (GPIO 45, active HIGH)

#pragma once
#include "weblog.h"
#include <WiFi.h>          // WiFi.localIP() for the on-screen logs/screenshot URL
#include <Wire.h>
#include <lvgl.h>
#include "esp_lcd_panel_rgb.h"
#include "esp_lcd_panel_ops.h"
#include "freertos/FreeRTOS.h"   // VSYNC handshake semaphores (double-buffer)
#include "freertos/semphr.h"
#include "esp_attr.h"            // IRAM_ATTR for the VSYNC ISR callback
#include "driver/gpio.h"
#include "esp_sleep.h"          // light sleep for the user-button "power off"
#include "board_pins.h"
#include "api_client.h"
#include "rp2040_link.h"   // confirmation chime on alarm save (link self-test)
#include "storage.h"
#include "screenshot_server.h"   // flush_cb mirrors frames into its shadow fb

// Large clock font (Montserrat 72px, digits + ":" + AM/PM) — assets/montserrat_clock.c
LV_FONT_DECLARE(montserrat_clock);
#include "ui/shared_components.h"
#include "ui/modal.h"
#include "ui/screen_turbo.h"
#include "ui/screen_debt.h"
#include "ui/screen_game.h"
#include "ui/screen_node.h"
#include "ui/screen_tickers.h"
#include "ui/screen_nft.h"

enum class ScreenId : uint8_t {
    CLOCK = 0,
    TURBO_STATS = 1,
    DEBT = 2,
    INFLATION_GAME = 3,
    NODE_NETWORK = 4,
    NFT = 5,      // penultimate — full-screen gallery
    TICKERS = 6,  // last — settings-like screener
    COUNT = 7
};

// ── Double-buffer VSYNC handshake (esp_lcd RGB + LVGL direct_mode) ─────────────
// num_fbs=2 keeps two PSRAM framebuffers; the panel swaps them on VSYNC so the
// glass never shows a half-drawn frame (no tearing on NFT loads / transitions).
// flush_cb queues the swap and THEN blocks until VSYNC, so by the time LVGL gets
// control back the panel is scanning the NEW buffer and the old one is safe to
// render into. (direct_mode — NOT full_refresh — means LVGL only redraws the
// CHANGED area, so a static screen isn't repainted → no flicker.)
static SemaphoreHandle_t s_rgbVsyncSem = nullptr;   // given by the VSYNC ISR
static SemaphoreHandle_t s_rgbGuiReady = nullptr;   // given by flush before it waits

// Runs inside the RGB panel's VSYNC interrupt. CONFIG_LCD_RGB_ISR_IRAM_SAFE=y →
// IRAM-resident, ISR-safe calls only (can fire during a flash-cache-disable).
static IRAM_ATTR bool rgbOnVsync(esp_lcd_panel_handle_t,
                                 const esp_lcd_rgb_panel_event_data_t*,
                                 void*) {
    BaseType_t hp = pdFALSE;
    if (s_rgbGuiReady && s_rgbVsyncSem &&
        xSemaphoreTakeFromISR(s_rgbGuiReady, &hp) == pdTRUE) {
        xSemaphoreGiveFromISR(s_rgbVsyncSem, &hp);
    }
    return hp == pdTRUE;
}

class UiManager {
public:
    void begin() {
        // lv_init() must come before initDisplayAndTouch() so the display
        // and input drivers can be registered inside that function.
        lv_init();
        initDisplayAndTouch();
        buildAllScreens();
        _loadScreenOrder();
        showScreen(ScreenId::CLOCK, false);  // instant first load — no animation
    }

    void loop() {
        lv_timer_handler();
        // Deferred OTA install: the install button (which runs INSIDE
        // lv_timer_handler) only sets this flag + shows the splash, because a
        // nested lv_timer_handler() there is a no-op (that's why the message
        // never painted). Now that we're OUTSIDE the handler, paint the splash
        // for a few frames so the user actually sees "Updating firmware...",
        // THEN start the blocking download.
        if (_otaInstallPending) {
            _otaInstallPending = false;
            for (int i = 0; i < 6; i++) { lv_timer_handler(); delay(30); }
            if (onOtaInstallConfirmed) onOtaInstallConfirmed();
        }
        updateClockIfNeeded();
        _checkScreenTimeout();
        _checkScreenCarousel();
        _pollHomeBg();
    }

    // Set backlight brightness level 1–5 immediately via LEDC PWM.
    void setScreenBrightness(uint8_t level) {
        static const uint8_t DUTY[5] = { 25, 70, 130, 185, 255 };
        level = constrain(level, 1, 5);
        ledcWrite(LCD_PIN_BL, DUTY[level - 1]);  // backlight PWM (addressed by pin in Arduino 3.x)
    }

    // Read brightness from NVS and apply it immediately. No-op while the
    // screen is off: the post-heartbeat call used to RELIGHT a screen the
    // user had just turned off (short press / timeout), every ~3 minutes.
    void applyStoredBrightness() {
        if (!_screenOn) return;
        setScreenBrightness(storage.getScreenBrightness());
    }

    // ── User button actions (top button, GPIO 38) ──────────────────────────
    // Short press: toggle the screen (backlight off/on) while the node keeps
    // running and mining in the background.
    void toggleScreen() {
        _screenOn = !_screenOn;
        if (_screenOn) applyStoredBrightness();
        else           ledcWrite(LCD_PIN_BL, 0);   // backlight off (channel 0)
    }

    // Long press (3 s): "power off" — backlight off and enter light sleep. RAM
    // and the LVGL framebuffer are retained, so a press resumes instantly where
    // it left off. We deliberately do NOT wire a factory-reset action to the
    // button, so the firmware can't be wiped by accident. GPIO 38 isn't an RTC
    // pin, so this uses light sleep (any-GPIO wake), not deep sleep.
    void enterSleep() {
        // With a USB host attached (web/serial console open), light sleep
        // drops the native USB-CDC connection — the console shows "device has
        // been lost" and reconnects find nothing until a wake. Degrade to a
        // plain screen-off while plugged into a computer, so logs keep
        // flowing; on a wall charger real light sleep still happens.
        if (Serial) {
            _screenOn = false;
            ledcWrite(LCD_PIN_BL, 0);
            Log.println("sleep: USB host attached — screen off only (no light sleep)");
            return;
        }
        ledcWrite(LCD_PIN_BL, 0);                         // backlight off
        gpio_wakeup_enable((gpio_num_t)BTN_USER_GPIO, GPIO_INTR_LOW_LEVEL);
        esp_sleep_enable_gpio_wakeup();
        // The main loop is FROZEN during light sleep — without a timer wake
        // the alarm could never fire while "powered off". Arm a wake ~2 s
        // before the next scheduled alarm so checkAlarmTrigger() catches its
        // firing window right after resume.
        esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_TIMER);
        uint64_t usToAlarm = _usUntilNextAlarm();
        if (usToAlarm > 0) esp_sleep_enable_timer_wakeup(usToAlarm);
        esp_light_sleep_start();                 // blocks until button press or alarm-time wake
        // Woken up (button OR alarm timer): restore the screen.
        _screenOn = true;
        applyStoredBrightness();
    }

    // Microseconds until ~2 s before the next enabled alarm occurrence
    // (respecting the per-day bitmask), or 0 when no alarm is scheduled /
    // the clock isn't synced yet.
    uint64_t _usUntilNextAlarm() {
        if (!storage.getAlarmEnabled()) return 0;
        time_t now = time(nullptr);
        if (now < 1600000000) return 0;          // NTP not synced — can't schedule
        struct tm t;
        localtime_r(&now, &t);
        for (int d = 0; d < 8; d++) {
            struct tm c = t;
            c.tm_mday += d;
            c.tm_hour  = storage.getAlarmHour();
            c.tm_min   = storage.getAlarmMinute();
            c.tm_sec   = 0;
            time_t ct = mktime(&c);              // normalizes day rollover
            if (ct <= now + 3) continue;         // already passed (or this very moment)
            struct tm cd;
            localtime_r(&ct, &cd);
            if (!storage.isAlarmActiveToday(cd.tm_wday)) continue;
            uint64_t secs = (uint64_t)(ct - now);
            return (secs > 2 ? secs - 2 : 1) * 1000000ULL;
        }
        return 0;
    }

    void showProvisioningScreen() {
        static bool shown = false;
        if (shown) return;
        shown = true;
        // Build a dedicated screen and load it instantly. We do NOT clean the
        // currently-active screen (cleaning a screen that may still be mid-load
        // animation corrupts LVGL and crashes → reset loop).
        lv_obj_t* scr = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(scr, lv_color_black(), 0);
        lv_obj_t* label = lv_label_create(scr);
        lv_label_set_text(label, "Connect your phone to:\nTurboUSD-Setup-XXXX\nthen open the page that appears.");
        lv_obj_set_style_text_color(label, lv_color_hex(0x3aff7a), 0);
        lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_center(label);
        lv_scr_load(scr);
    }

