TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
    bool isOnNodeScreen() { return currentScreen == ScreenId::NODE_NETWORK; }

    // RGB panel handle — the screenshot server reads its PSRAM framebuffer.
    esp_lcd_panel_handle_t lcdPanel() const { return _lcdPanel; }

    // Called by main.cpp when the nightly OTA check finds a newer version.
    // Creates a small persistent badge at the bottom of the screen. Tapping
    // it opens a confirm dialog; on confirm, onOtaInstallConfirmed is called.
    void showOtaBadge(const char* version, const char* notes = "") {
        clearOtaBadge(); // remove any existing one first
        strncpy(_otaNotes, notes ? notes : "", sizeof(_otaNotes) - 1);
        _otaNotes[sizeof(_otaNotes) - 1] = '\0';

        _otaBadge = lv_obj_create(lv_layer_top()); // layer_top() floats over all screens
        lv_obj_set_size(_otaBadge, LV_PCT(100), 42);
        lv_obj_align(_otaBadge, LV_ALIGN_BOTTOM_MID, 0, 0);
        lv_obj_set_style_bg_color(_otaBadge, lv_color_hex(0x1c2c1c), 0);
        lv_obj_set_style_border_color(_otaBadge, lv_color_hex(0x3aff7a), 0);
        lv_obj_set_style_border_width(_otaBadge, 1, 0);
        lv_obj_set_style_border_side(_otaBadge, LV_BORDER_SIDE_TOP, 0);
        lv_obj_set_style_pad_all(_otaBadge, 0, 0);
        lv_obj_add_flag(_otaBadge, LV_OBJ_FLAG_CLICKABLE);

        lv_obj_t* label = lv_label_create(_otaBadge);
        char text[48];
        snprintf(text, sizeof(text), "\xEF\x81\xB7 Firmware %s available, tap to install", version);
        lv_label_set_text(label, text);
        lv_obj_set_style_text_color(label, lv_color_hex(0x3aff7a), 0);
        lv_obj_set_style_text_font(label, &lv_font_montserrat_12, 0);
        lv_obj_center(label);

        // Store version string in badge's user_data so the callback can show it
        static char versionBuf[24];
        strncpy(versionBuf, version, sizeof(versionBuf) - 1);
        lv_obj_set_user_data(_otaBadge, versionBuf);
        lv_obj_add_event_cb(_otaBadge, onOtaBadgeTapped, LV_EVENT_CLICKED, this);
    }

    void clearOtaBadge() {
        if (_otaBadge) { lv_obj_del(_otaBadge); _otaBadge = nullptr; }
    }

    // Set by the config popup's "Check for updates" button; the main loop polls
    // it, runs the OTA check on the network thread, and then either shows the
    // install badge (update found) or a transient "up to date" bar.
    volatile bool otaCheckRequested = false;

    // Transient bottom bar for a one-off OTA message (auto-dismisses ~4 s). Not
    // shown if an install badge is already up.
    void showOtaInfo(const char* msg) {
        if (_otaBadge) return;
        lv_obj_t* bar = lv_obj_create(lv_layer_top());
        lv_obj_set_size(bar, LV_PCT(100), 40);
        lv_obj_align(bar, LV_ALIGN_BOTTOM_MID, 0, 0);
        lv_obj_set_style_bg_color(bar, lv_color_hex(0x141414), 0);
        lv_obj_set_style_border_color(bar, lv_color_hex(0x3a3a3a), 0);
        lv_obj_set_style_border_width(bar, 1, 0);
        lv_obj_set_style_border_side(bar, LV_BORDER_SIDE_TOP, 0);
        lv_obj_t* l = lv_label_create(bar);
        lv_label_set_text(l, msg);
        lv_obj_set_style_text_color(l, lv_color_hex(0xd8d8dc), 0);
        lv_obj_set_style_text_font(l, &lv_font_montserrat_12, 0);
        lv_obj_center(l);
        lv_timer_t* t = lv_timer_create([](lv_timer_t* tm) {
            lv_obj_t* b = (lv_obj_t*)tm->user_data;
            if (b) lv_obj_del(b);
            lv_timer_del(tm);
        }, 4000, bar);
        lv_timer_set_repeat_count(t, 1);
    }

    // Set this before begin(). Called when user confirms "Install".
    std::function<void()> onOtaInstallConfirmed;

    // ── NFT fullscreen ("digital photo frame") ────────────────────────────────
    // A double-press of the top button toggles it — but only while the NFT
    // screen is showing (or to exit once you're in it). main.cpp only routes a
    // double-press to us when nftDoublePressActive() is true.
    bool _nftFullscreen = false;
    bool nftDoublePressActive() const { return currentScreen == ScreenId::NFT || _nftFullscreen; }
    void toggleNftFullscreen() {
        if (currentScreen != ScreenId::NFT && !_nftFullscreen) return;
        _nftFullscreen = !_nftFullscreen;
        nftScreen.setFullscreen(_nftFullscreen);
    }

    bool miningFeedNeedsRefresh() {
        uint32_t now = millis();
        if (now - lastMiningFeedFetch < MINING_FEED_REFRESH_MS) return false;
        lastMiningFeedFetch = now;
        return true;
    }

    // A failed feed fetch shouldn't cost the whole refresh window — pull the
    // next attempt in to ~3 s so a transient TLS/memory hiccup self-heals fast.
    void retryMiningFeedSoon() {
        lastMiningFeedFetch = millis() - MINING_FEED_REFRESH_MS + 3000;
    }

    // Backend-computed stats for the selected ticker → painted generically.
    void updateTickerStats(const TickerStats& s) {
        turboScreen.applyStats(s);
    }

    void loadOhlcvChart(OhlcvCandle* candles, int count) {
        turboScreen.loadRealCandles(candles, count, turboGroupDays());
    }

    // Turbo chart timeframe (1D/1W/1M dropdown) → candle grouping for
    // fetchOhlcvHistory(). 12 monthly bars keep the GT daily fetch at 360 rows.
    int turboGroupDays() { return turboScreen.timeframeSel == 0 ? 1 : (turboScreen.timeframeSel == 1 ? 7 : 30); }
    int turboBars()      { return turboScreen.timeframeSel == 2 ? 12 : 26; }
    bool turboTfConsumeDirty() {
        if (!turboScreen.tfDirty) return false;
        turboScreen.tfDirty = false;
        return true;
    }
    // True (once) right after the Ticker Stats selection changed on-device, so
    // main.cpp refetches the stats + chart immediately instead of waiting for
    // the periodic window.
    bool tickerStatsConsumeDirty() {
        if (!_tickerStatsDirty) return false;
        _tickerStatsDirty = false;
        return true;
    }

    // Footer picker on the Ticker Stats screen: open the Token Screener's search
    // dialog in "pick" mode; on selection, persist the choice + trigger a refetch.
    static void _onStatsTickerPick(void* ud) {
        UiManager* self = (UiManager*)ud;
        if (self) self->tickerScreen.openPickDialog(_onStatsTickerPicked, self);
    }
    static void _onStatsTickerPicked(void* ud, const SearchResultEntry& e) {
        UiManager* self = (UiManager*)ud;
        if (!self) return;
        storage.setTickerStatsPool(e.pair_address);
        storage.setTickerStatsChain(e.chain_id);
        storage.setTickerStatsSymbol(e.base_symbol);
        self->_tickerStatsDirty     = true;   // stats refetch now (main.cpp)
        self->turboScreen.tfDirty   = true;   // chart refetch for the new pool
    }

