TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
    // Called from the touch input driver whenever the screen is physically touched.
    // Resets the inactivity timer and wakes the backlight if it was off.
    void _onTouchActivity() {
        _lastTouchMs  = millis();
        if (!_screenIsOn) {
            _screenIsOn = true;
            applyStoredBrightness();
        }
    }

    // Checked every loop() tick. Turns off the backlight after the configured
    // idle period when always-on mode is disabled.
    void _checkScreenTimeout() {
        if (!storage.getScreenAlwaysOn()) {
            uint32_t timeoutMs = (uint32_t)storage.getScreenTimeoutMins() * 60UL * 1000UL;
            if (_screenIsOn && (millis() - _lastTouchMs > timeoutMs)) {
                _screenIsOn = false;
                ledcWrite(LCD_PIN_BL, 0);  // channel 0 = backlight
            }
        }
        // Keep the global backlight state fresh (button toggle AND idle timeout).
        // Screens pause their heavy network/decode work while this is false so a
        // dark screen can't starve the task watchdog into a reboot.
        g_displayAwake() = (_screenOn && _screenIsOn);
    }

private:
    ScreenId currentScreen = ScreenId::CLOCK;
    lv_obj_t* screens[(int)ScreenId::COUNT] = { nullptr };
    lv_obj_t* alarmOverlay = nullptr;
    // Alarm overlay blink (green ↔ white) + big "TURBO ALARM!" background.
    static constexpr uint32_t ALARM_GREEN = 0x43e397;   // matches the clock digits
    lv_obj_t*    _alarmBgText     = nullptr;
    lv_obj_t*    _alarmStopBtn    = nullptr;
    lv_obj_t*    _alarmStopLbl    = nullptr;
    lv_timer_t*  _alarmBlinkTimer = nullptr;
    uint8_t      _alarmBlinkPhase = 0;

    // Screen timeout state
    uint32_t _lastTouchMs = 0;     // millis() of the last touch event
    bool     _screenIsOn  = true;  // false while backlight is off due to timeout

    // Swipe order: _swipeOrder[swipe_pos] = ScreenId value.
    // Default (matches the intended UX order):
    //   pos 0 → CLOCK(0)        Home
    //   pos 1 → TURBO_STATS(1)  Price/chart
    //   pos 2 → TICKERS(6)      Token screener
    //   pos 3 → NFT(5)          NFT gallery      ← now right after Tickers
    //   pos 4 → DEBT(2)         US debt
    //   pos 5 → INFLATION_GAME(3) Inflation calculator
    //   pos 6 → NODE_NETWORK(4) Node status     ← last
    // Can be overridden per-device from NVS (set via web setup page). Position 0 is always CLOCK.
    uint8_t _swipeOrder[(int)ScreenId::COUNT] = { 0, 1, 6, 5, 2, 3, 4 };
    int     _swipeCount = (int)ScreenId::COUNT;   // visible screens (hidden ones filtered out)
    int     _currentSwipePos = 0;
    uint32_t _carouselLastMs = 0;                 // last screen change (manual or auto); gates the carousel

    // Swipe-vs-tap disambiguation. The touch read_cb records where a press
    // started and, if the finger travels past TAP_SLOP_PX before release, marks
    // the whole gesture as a swipe. Popup-opening handlers (alarm, calendar,
    // gear, …) consult _touchWasSwipe and bail, so a swipe that HAPPENS to start
    // on an icon no longer also fires that icon's click — which used to open the
    // popup on the screen you just swiped to. LVGL doesn't cancel CLICKED on
    // movement by itself (the icons aren't in a scrollable container), so we
    // gate it explicitly here.
    static constexpr lv_coord_t TAP_SLOP_PX = 22;
    bool       _pressActive  = false;
    bool       _touchWasSwipe = false;
    lv_coord_t _pressStartX  = 0;
    lv_coord_t _pressStartY  = 0;

    TurboScreen  turboScreen;
    DebtScreen   debtScreen;
    GameScreen   gameScreen;
    NodeScreen   nodeScreen;
    TickerScreen tickerScreen;
    NftScreen    nftScreen;

    DebtData latestDebt;
    uint32_t lastMiningFeedFetch = 0;
    bool _tickerStatsDirty = false;   // set on device-side ticker pick → main.cpp refetches now

    esp_lcd_panel_handle_t _lcdPanel = nullptr;
    lv_obj_t* _otaBadge = nullptr;

    // TCA9535 IO expander output shadow registers (one byte per 8-pin port).
    // We must track current output state to do single-pin set/clear, since
    // the TCA9535 write register takes the full port byte each time.
    uint8_t _expanderPort0 = 0xFF;  // all pins high by default
    uint8_t _expanderPort1 = 0xFF;

    int debtYearsRangeIndex = 4;
    int sincePeriodIndex = 4;
    int rateUnitIndex = 0;
    int gameYearsIndex = 0;            // 0 = REAL TIME (default), then 1Y…100Y
    bool   _gameRtActive   = false;    // real-time game mode currently driving the chart
    double _gameRtBaseline = 0.0;      // dollar value mapped to chart unit 0
    int    _gameRtCount    = 0;        // points drawn so far (fill phase: left → right)
    double _debtPerSecond = 0.0;   // US-debt-clock rate, derived from history
    bool   _debtHistLoaded = false;
    bool   _debtRangeDirty = false; // range picker changed → refetch history (debounced)
    time_t _pendingBlockCreatedAt = 0;   // pending mining block opened at (UTC)
    double _pendingBlockReward    = 100.0;
    double _annualDebasementRate = 0.08;  // yearly $ debasement for the inflation game,
                                          // derived from real debt growth (fallback 8%)

    lv_obj_t* clockTimeLabel = nullptr;
    lv_obj_t* clockDateLabel = nullptr;
    lv_obj_t* clockAlarmLabel = nullptr;
    lv_obj_t* clockWeatherLabel = nullptr;  // "23° · 48%" line on the Home screen
    uint32_t lastClockRedrawSecond = 255;
    SharedFooterRefs clockFooterRefs;

    // ── Home background image (web-set) + per-element legibility plates ──────
    lv_obj_t*    _homeBgImg   = nullptr;
    lv_img_dsc_t _homeBgDsc   = {};
    uint8_t*     _homeBgPx    = nullptr;   // live bitmap (freed on replace)
    uint8_t*     _homeBgNewPx = nullptr;   // bg task → UI handoff
    uint16_t     _homeBgW = 0, _homeBgH = 0;
    char         _homeBgAppliedUrl[400] = {};   // URL currently shown ("" = none)
    char         _homeBgWantUrl[400]    = {};   // URL to fetch next
    volatile bool _homeBgReady = false;
    volatile TaskHandle_t _homeBgTask = nullptr;
    uint32_t     _homeBgNextTry = 0;            // retry gate after a failed fetch
    uint32_t     _homeBgCheckAt = 0;            // throttle the NVS URL poll (~3 s)

    // Subtle per-element legibility backing for the Home screen when a
    // background image is active: a small rounded translucent plate + soft
    // shadow behind the DATE and the TIME (each sized to its own text + a little
    // padding), and a matching fill for the alarm pill (it already has a
    // border/radius). `on=false` removes it (plain text on black).
    void _setHomePlates(bool on) {
        lv_obj_t* plated[2] = { clockDateLabel, clockTimeLabel };
        for (int i = 0; i < 2; i++) {
            lv_obj_t* l = plated[i];
            if (!l) continue;
            lv_obj_set_style_bg_color(l, lv_color_black(), 0);
            lv_obj_set_style_bg_opa(l, on ? LV_OPA_50 : LV_OPA_TRANSP, 0);
            lv_obj_set_style_radius(l, 10, 0);
            lv_obj_set_style_pad_hor(l, on ? 12 : 0, 0);
            lv_obj_set_style_pad_ver(l, on ? 5  : 0, 0);
            lv_obj_set_style_shadow_color(l, lv_color_black(), 0);
            lv_obj_set_style_shadow_width(l, on ? 14 : 0, 0);
            lv_obj_set_style_shadow_opa(l, on ? LV_OPA_50 : LV_OPA_TRANSP, 0);
        }
        // Alarm pill keeps its own border/radius/padding — just tint + soften it.
        if (clockAlarmLabel) {
            lv_obj_set_style_bg_color(clockAlarmLabel, lv_color_black(), 0);
            lv_obj_set_style_bg_opa(clockAlarmLabel, on ? LV_OPA_50 : LV_OPA_TRANSP, 0);
            lv_obj_set_style_shadow_color(clockAlarmLabel, lv_color_black(), 0);
            lv_obj_set_style_shadow_width(clockAlarmLabel, on ? 14 : 0, 0);
            lv_obj_set_style_shadow_opa(clockAlarmLabel, on ? LV_OPA_50 : LV_OPA_TRANSP, 0);
        }
    }

