TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
    // Runs every loop tick: applies a decoded background, notices a URL change
    // from the config sync, and spawns the download on a bg task (core 0).
    void _pollHomeBg() {
        if (!_homeBgImg) return;

        if (_homeBgReady) {
            _homeBgReady = false;
            if (_homeBgNewPx) {
                if (_homeBgPx && _homeBgPx != _homeBgNewPx) free(_homeBgPx);
                _homeBgPx = _homeBgNewPx; _homeBgNewPx = nullptr;
                _homeBgDsc.header.always_zero = 0;
                _homeBgDsc.header.cf = LV_IMG_CF_TRUE_COLOR;
                _homeBgDsc.header.w  = _homeBgW;
                _homeBgDsc.header.h  = _homeBgH;
                _homeBgDsc.data_size = (uint32_t)_homeBgW * _homeBgH * 2;
                _homeBgDsc.data      = _homeBgPx;
                lv_img_set_src(_homeBgImg, &_homeBgDsc);
                lv_obj_align(_homeBgImg, LV_ALIGN_CENTER, 0, 0);
                lv_obj_clear_flag(_homeBgImg, LV_OBJ_FLAG_HIDDEN);
                _setHomePlates(true);   // legibility plates behind date/time/alarm
            }
        }

        // React to a URL change pushed down by the heartbeat config sync. The
        // NVS read + String alloc is throttled (~3 s) so it doesn't run on every
        // loop tick — the config only changes on a heartbeat anyway.
        if (millis() - _homeBgCheckAt < 3000) return;
        _homeBgCheckAt = millis();
        String url = storage.getHomeBgUrl();
        if (url != _homeBgAppliedUrl && url != _homeBgWantUrl) {
            if (url.length() == 0) {   // cleared on the web → hide bg + plates
                _homeBgAppliedUrl[0] = '\0';
                _homeBgWantUrl[0]    = '\0';
                lv_obj_add_flag(_homeBgImg, LV_OBJ_FLAG_HIDDEN);
                _setHomePlates(false);
            } else {
                strncpy(_homeBgWantUrl, url.c_str(), sizeof(_homeBgWantUrl) - 1);
                _homeBgNextTry = 0;   // fetch asap
            }
        }

        if (_homeBgWantUrl[0] && strcmp(_homeBgWantUrl, _homeBgAppliedUrl) != 0 &&
            !_homeBgTask && g_displayAwake() && netTlsRamOk() && millis() >= _homeBgNextTry) {
            _homeBgNextTry = millis() + 30000;   // if the fetch fails, retry in 30 s
            // 16 KB: TLS handshake + image decode is stack-hungry (matches the
            // NFT image worker; 6 KB risks a stack-overflow reboot).
            xTaskCreatePinnedToCore(_homeBgTaskFn, "home_bg", 16384, this, 1,
                                    (TaskHandle_t*)&_homeBgTask, 0);
        }
    }

    // Percent-encode a URL for use as the wsrv.nl ?url= parameter.
    static String _encodeUrl(const char* s) {
        static const char* hex = "0123456789ABCDEF";
        String out;
        for (const char* p = s; *p; p++) {
            char c = *p;
            if (isalnum((unsigned char)c) || c == '-' || c == '_' || c == '.' || c == '~') out += c;
            else { out += '%'; out += hex[(c >> 4) & 0xF]; out += hex[c & 0xF]; }
        }
        return out;
    }

    static void _homeBgTaskFn(void* arg) {
        UiManager* self = (UiManager*)arg;
        if (!self) { vTaskDelete(nullptr); return; }
        char url[400];
        strncpy(url, self->_homeBgWantUrl, sizeof(url) - 1); url[sizeof(url) - 1] = '\0';
        if (netWaitTlsRam(3000)) { /* headroom */ }
        netLock();
        uint16_t w = 0, h = 0;
        // Fit within the 480×480 home area; 1:1 images fill it edge to edge.
        uint8_t* px = imgdec::fetchRgb565(url, 480, 480, "homebg", url, &w, &h);
        if (!px) {
            // Raw fetch/decode failed — WEBP (magic "RIFF"/0x5249), or a valid
            // PNG/JPEG that's too big to decode on-device. The wsrv.nl proxy
            // resizes to 480px + transcodes to PNG server-side. Cache the PNG
            // under the ORIGINAL url so next boot decodes straight from flash.
            String prox = "https://wsrv.nl/?url=" + _encodeUrl(url) + "&w=480&output=png";
            px = imgdec::fetchRgb565(prox.c_str(), 480, 480, "homebg", url, &w, &h);
        }
        netUnlock();
        if (px) {
            self->_homeBgNewPx = px;
            self->_homeBgW = w; self->_homeBgH = h;
            strncpy(self->_homeBgAppliedUrl, url, sizeof(self->_homeBgAppliedUrl) - 1);
            self->_homeBgReady = true;   // _pollHomeBg applies on core 1
        }
        self->_homeBgTask = nullptr;
        vTaskDelete(nullptr);
    }

    // Ambient readings from the AHT20 on the RP2040 (polled over UART in the
    // main loop). _sensorValid is false until the first good read, or whenever
    // a read fails — the UI then shows "--" instead of a stale/zero value.
    float _tempC        = 0.0f;
    int   _humidityPct  = 0;
    bool  _sensorValid  = false;

    bool  _screenOn     = true;   // user-button screen toggle state
    int   _onlineNodeCount = 0;   // total online nodes in the network (footer "| N NODES")

    // ── Screen swipe order ───────────────────────────────────────────────────

    // Load the user-defined swipe order from NVS.
    // Format: comma-separated ScreenId integers, e.g. "0,4,1,2,3,5,6".
    // Position 0 must always be 0 (CLOCK/Home) — enforced here.
    // Falls back to the default 0,1,2,3,4,5,6 if NVS entry is absent/malformed.
    void _loadScreenOrder() {
        String stored = storage.getScreenOrder();
        if (stored.length() == 0) return;   // use default array initialiser values

        uint8_t tmp[(int)ScreenId::COUNT];
        int pos = 0;
        int idx = 0;
        int len = stored.length();

        while (idx < len && pos < (int)ScreenId::COUNT) {
            int sep = stored.indexOf(',', idx);
            if (sep < 0) sep = len;
            int val = stored.substring(idx, sep).toInt();
            if (val >= 0 && val < (int)ScreenId::COUNT) {
                tmp[pos++] = (uint8_t)val;
            }
            idx = sep + 1;
        }

        // Only apply if we got exactly COUNT entries and position 0 is CLOCK
        if (pos == (int)ScreenId::COUNT && tmp[0] == (uint8_t)ScreenId::CLOCK) {
            memcpy(_swipeOrder, tmp, sizeof(_swipeOrder));
        }
        _applyHiddenScreens();
    }

    // Drop hidden screens (web setup "eye" toggles / screen_hidden CSV) from
    // the rotation. Home/CLOCK can never be hidden.
    void _applyHiddenScreens() {
        String hid = storage.getScreenHidden();
        uint8_t filtered[(int)ScreenId::COUNT];
        int fc = 0;
        for (int i = 0; i < (int)ScreenId::COUNT; i++) {
            uint8_t id = _swipeOrder[i];
            bool hidden = false;
            if (id != (uint8_t)ScreenId::CLOCK && hid.length()) {
                int idx2 = 0, len = hid.length();
                while (idx2 < len) {
                    int sep = hid.indexOf(',', idx2);
                    if (sep < 0) sep = len;
                    if (hid.substring(idx2, sep).toInt() == (int)id) { hidden = true; break; }
                    idx2 = sep + 1;
                }
            }
            if (!hidden) filtered[fc++] = id;
        }
        if (fc < 1) { filtered[0] = (uint8_t)ScreenId::CLOCK; fc = 1; }
        memcpy(_swipeOrder, filtered, fc);
        _swipeCount = fc;
        if (_currentSwipePos >= _swipeCount) _currentSwipePos = 0;
    }

    // ── TCA9535 helpers ──────────────────────────────────────────────────────

    // Write one byte to a TCA9535 register over I2C.
    void expanderWriteReg(uint8_t reg, uint8_t val) {
        Wire.beginTransmission(IO_EXPANDER_I2C_ADDR);
        Wire.write(reg);
        Wire.write(val);
        Wire.endTransmission();
    }

    // Set or clear a single IO expander pin, preserving all other pin states.
    // Pins 0-7 → port 0; pins 8-15 → port 1.
    void expanderSetPin(uint8_t pin, uint8_t level) {
        if (pin < 8) {
            if (level) _expanderPort0 |=  (1u << pin);
            else       _expanderPort0 &= ~(1u << pin);
            expanderWriteReg(0x02, _expanderPort0);  // output port 0
        } else {
            uint8_t bit = pin - 8;
            if (level) _expanderPort1 |=  (1u << bit);
            else       _expanderPort1 &= ~(1u << bit);
            expanderWriteReg(0x03, _expanderPort1);  // output port 1
        }
    }

    // ── ST7701S bit-bang SPI ─────────────────────────────────────────────────
    // Protocol: 9-bit frames, MSB first (bit 8 = D/CX: 0=cmd, 1=data).
    // CS is driven through the IO expander; CLK and MOSI are direct GPIOs.
    // Faithfully ported from Seeed's SPI_SendData / SPI_WriteComm / SPI_WriteData
    // in components/bsp/src/boards/lcd_panel_config.c.

    void st7701sSpiSend9(uint16_t bits9) {
        for (int n = 0; n < 9; n++) {
            digitalWrite(LCD_SPI_MOSI, (bits9 & 0x0100) ? HIGH : LOW);
            bits9 <<= 1;
            digitalWrite(LCD_SPI_CLK, HIGH);
            delayMicroseconds(10);
            digitalWrite(LCD_SPI_CLK, LOW);
            delayMicroseconds(10);
        }
    }

    // Send a command byte (D/CX = 0). Matches Seeed's SPI_WriteComm() exactly:
    // two CS-framed 9-bit transactions — the first carries the high byte of a
    // 16-bit command address (always 0 for the ST7701S's single-byte commands),
    // the second carries the actual command byte with D/CX = 0.
    void st7701sCmd(uint8_t cmd) {
        expanderSetPin(EXPANDER_PIN_LCD_CS, 0);
        delayMicroseconds(10);
        digitalWrite(LCD_SPI_CLK, LOW);
        delayMicroseconds(10);
        st7701sSpiSend9(((uint16_t)(cmd >> 8) & 0xFF) | 0x2000u);
        digitalWrite(LCD_SPI_CLK, HIGH);
        delayMicroseconds(10);
        digitalWrite(LCD_SPI_CLK, LOW);
        expanderSetPin(EXPANDER_PIN_LCD_CS, 1);
        delayMicroseconds(10);
        expanderSetPin(EXPANDER_PIN_LCD_CS, 0);
        delayMicroseconds(10);
        st7701sSpiSend9((uint16_t)(cmd & 0xFF));  // D/CX = bit8 = 0 (command)
        expanderSetPin(EXPANDER_PIN_LCD_CS, 1);
        delayMicroseconds(10);
    }

    // Send a data byte (D/CX = 1). Matches Seeed's SPI_WriteData().
    void st7701sData(uint8_t data) {
        uint16_t bits9 = ((uint16_t)(data & 0xFF)) | 0x0100u;  // D/CX = 1
        expanderSetPin(EXPANDER_PIN_LCD_CS, 0);
        delayMicroseconds(10);
        digitalWrite(LCD_SPI_CLK, LOW);
        delayMicroseconds(10);
        st7701sSpiSend9(bits9);
        digitalWrite(LCD_SPI_CLK, HIGH);
        delayMicroseconds(10);
        digitalWrite(LCD_SPI_CLK, LOW);
        delayMicroseconds(10);
        expanderSetPin(EXPANDER_PIN_LCD_CS, 1);
        delayMicroseconds(10);
    }

    // Full ST7701S initialisation sequence for the D1's GX 4.0-inch panel.
    // Copied verbatim from Seeed's lcd_panel_st7701s_init() in lcd_panel_config.c,
    // translated to st7701sCmd() / st7701sData() calls.
    void st7701sInit() {
        // Page 0 (manufacturer command enable)
        st7701sCmd(0xFF); st7701sData(0x77); st7701sData(0x01);
        st7701sData(0x00); st7701sData(0x00); st7701sData(0x10);

        st7701sCmd(0xC0); st7701sData(0x3B); st7701sData(0x00);  // 480×480
        st7701sCmd(0xC1); st7701sData(0x0D); st7701sData(0x02);
        st7701sCmd(0xC2); st7701sData(0x31); st7701sData(0x05);
        st7701sCmd(0xC7); st7701sData(0x04);
        st7701sCmd(0xCD); st7701sData(0x08);

        // Positive gamma
        st7701sCmd(0xB0);
        st7701sData(0x00); st7701sData(0x11); st7701sData(0x18); st7701sData(0x0E);
        st7701sData(0x11); st7701sData(0x06); st7701sData(0x07); st7701sData(0x08);
        st7701sData(0x07); st7701sData(0x22); st7701sData(0x04); st7701sData(0x12);
        st7701sData(0x0F); st7701sData(0xAA); st7701sData(0x31); st7701sData(0x18);

        // Negative gamma
        st7701sCmd(0xB1);
        st7701sData(0x00); st7701sData(0x11); st7701sData(0x19); st7701sData(0x0E);
        st7701sData(0x12); st7701sData(0x07); st7701sData(0x08); st7701sData(0x08);
        st7701sData(0x08); st7701sData(0x22); st7701sData(0x04); st7701sData(0x11);
        st7701sData(0x11); st7701sData(0xA9); st7701sData(0x32); st7701sData(0x18);

        // Page 1
        st7701sCmd(0xFF); st7701sData(0x77); st7701sData(0x01);
        st7701sData(0x00); st7701sData(0x00); st7701sData(0x11);

        st7701sCmd(0xB0); st7701sData(0x60);
        st7701sCmd(0xB1); st7701sData(0x32);
        st7701sCmd(0xB2); st7701sData(0x07);
        st7701sCmd(0xB3); st7701sData(0x80);
        st7701sCmd(0xB5); st7701sData(0x49);
        st7701sCmd(0xB7); st7701sData(0x85);
        st7701sCmd(0xB8); st7701sData(0x21);
        st7701sCmd(0xC1); st7701sData(0x78);
        st7701sCmd(0xC2); st7701sData(0x78);

        delay(20);

