TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        st7701sCmd(0xE0); st7701sData(0x00); st7701sData(0x1B); st7701sData(0x02);

        st7701sCmd(0xE1);
        st7701sData(0x08); st7701sData(0xA0); st7701sData(0x00); st7701sData(0x00);
        st7701sData(0x07); st7701sData(0xA0); st7701sData(0x00); st7701sData(0x00);
        st7701sData(0x00); st7701sData(0x44); st7701sData(0x44);

        st7701sCmd(0xE2);
        st7701sData(0x11); st7701sData(0x11); st7701sData(0x44); st7701sData(0x44);
        st7701sData(0xED); st7701sData(0xA0); st7701sData(0x00); st7701sData(0x00);
        st7701sData(0xEC); st7701sData(0xA0); st7701sData(0x00); st7701sData(0x00);

        st7701sCmd(0xE3);
        st7701sData(0x00); st7701sData(0x00); st7701sData(0x11); st7701sData(0x11);

        st7701sCmd(0xE4); st7701sData(0x44); st7701sData(0x44);

        st7701sCmd(0xE5);
        st7701sData(0x0A); st7701sData(0xE9); st7701sData(0xD8); st7701sData(0xA0);
        st7701sData(0x0C); st7701sData(0xEB); st7701sData(0xD8); st7701sData(0xA0);
        st7701sData(0x0E); st7701sData(0xED); st7701sData(0xD8); st7701sData(0xA0);
        st7701sData(0x10); st7701sData(0xEF); st7701sData(0xD8); st7701sData(0xA0);

        st7701sCmd(0xE6);
        st7701sData(0x00); st7701sData(0x00); st7701sData(0x11); st7701sData(0x11);

        st7701sCmd(0xE7); st7701sData(0x44); st7701sData(0x44);

        st7701sCmd(0xE8);
        st7701sData(0x09); st7701sData(0xE8); st7701sData(0xD8); st7701sData(0xA0);
        st7701sData(0x0B); st7701sData(0xEA); st7701sData(0xD8); st7701sData(0xA0);
        st7701sData(0x0D); st7701sData(0xEC); st7701sData(0xD8); st7701sData(0xA0);
        st7701sData(0x0F); st7701sData(0xEE); st7701sData(0xD8); st7701sData(0xA0);

        st7701sCmd(0xEB);
        st7701sData(0x02); st7701sData(0x00); st7701sData(0xE4); st7701sData(0xE4);
        st7701sData(0x88); st7701sData(0x00); st7701sData(0x40);

        st7701sCmd(0xEC); st7701sData(0x3C); st7701sData(0x00);

        st7701sCmd(0xED);
        st7701sData(0xAB); st7701sData(0x89); st7701sData(0x76); st7701sData(0x54);
        st7701sData(0x02); st7701sData(0xFF); st7701sData(0xFF); st7701sData(0xFF);
        st7701sData(0xFF); st7701sData(0xFF); st7701sData(0xFF); st7701sData(0x20);
        st7701sData(0x45); st7701sData(0x67); st7701sData(0x98); st7701sData(0xBA);

        st7701sCmd(0x36); st7701sData(0x10);

        // Page 3 (internal oscillator fine-tune)
        st7701sCmd(0xFF); st7701sData(0x77); st7701sData(0x01);
        st7701sData(0x00); st7701sData(0x00); st7701sData(0x13);
        st7701sCmd(0xE5); st7701sData(0xE4);

        // Back to page 0 for display control
        st7701sCmd(0xFF); st7701sData(0x77); st7701sData(0x01);
        st7701sData(0x00); st7701sData(0x00); st7701sData(0x00);

        st7701sCmd(0x3A); st7701sData(0x60);  // pixel format: RGB666 (matches 16-data-line layout)
        st7701sCmd(0x21);                      // display inversion on (required for this panel)
        st7701sCmd(0x11);                      // sleep out
        delay(120);
        st7701sCmd(0x29);                      // display on
        delay(20);

        // Deassert CS / idle state
        expanderSetPin(EXPANDER_PIN_LCD_CS, 1);
        digitalWrite(LCD_SPI_CLK, HIGH);
        digitalWrite(LCD_SPI_MOSI, HIGH);
    }

    // ── Main hardware bring-up ────────────────────────────────────────────────

    void initDisplayAndTouch() {
        // 1. I2C bus — shared by TCA9535 IO expander and FT6336U touch.
        Wire.begin(I2C_PIN_SDA, I2C_PIN_SCL, 400000UL);

        // 2. TCA9535 IO expander — configure port 0 pins 4, 5, 7 as outputs;
        //    port 1 pins 8 (bit 0) and 10 (bit 2) as outputs; rest as inputs.
        //    TCA9535 config register: 0 = output, 1 = input (default all 1).
        //    Port 0: clear bits 4, 5, 7 → config = 0b01001111 = 0x4F
        //    Port 1: clear bits 0, 2   → config = 0b11111010 = 0xFA
        expanderWriteReg(0x06, 0x4F);  // port 0 direction
        expanderWriteReg(0x07, 0xFA);  // port 1 direction
        // Drive all outputs high initially
        expanderWriteReg(0x02, _expanderPort0);
        expanderWriteReg(0x03, _expanderPort1);

        // 3. Power on RP2040 and BMP sensor via expander (keep high = enabled).
        expanderSetPin(EXPANDER_PIN_RP2040_RST, 1);
        expanderSetPin(EXPANDER_PIN_BMP_PWR,    1);

        // 4. ST7701S panel reset pulse (active low, 10 ms).
        expanderSetPin(EXPANDER_PIN_LCD_RST, 0);
        delay(10);
        expanderSetPin(EXPANDER_PIN_LCD_RST, 1);
        delay(50);  // wait for controller to come out of reset

        // 5. FT6336U touch reset pulse (active low, 5 ms).
        expanderSetPin(EXPANDER_PIN_TP_RST, 0);
        delay(5);
        expanderSetPin(EXPANDER_PIN_TP_RST, 1);
        delay(50);

        // 6. Set up GPIO pins for bit-bang SPI (ST7701S init commands).
        pinMode(LCD_SPI_CLK,  OUTPUT);
        pinMode(LCD_SPI_MOSI, OUTPUT);
        digitalWrite(LCD_SPI_CLK,  HIGH);
        digitalWrite(LCD_SPI_MOSI, HIGH);

        // 7. Send the ~100 ST7701S init commands over bit-bang SPI.
        st7701sInit();

        // 8. Create RGB panel via ESP-IDF 5.x esp_lcd component.
        //    Frame buffer lives in PSRAM (480×480×2 = ~450 KB).
        esp_lcd_rgb_panel_config_t panelCfg = {};
        panelCfg.clk_src                    = LCD_CLK_SRC_XTAL;  // DEFAULT renamed in IDF 5.1+
        panelCfg.data_width                 = 16;
        // bits_per_pixel left 0 → defaults to data_width (16bpp RGB565).
        // IDF 5.3+ renamed psram_trans_align → dma_burst_size (bytes, power of 2,
        // in a union with the deprecated name). 64 was the old alignment and is a
        // valid burst size.
        panelCfg.dma_burst_size             = 64;
        panelCfg.hsync_gpio_num             = LCD_PIN_HSYNC;
        panelCfg.vsync_gpio_num             = LCD_PIN_VSYNC;
        panelCfg.de_gpio_num                = LCD_PIN_DE;
        panelCfg.pclk_gpio_num             = LCD_PIN_PCLK;
        panelCfg.disp_gpio_num             = GPIO_NUM_NC;
        panelCfg.data_gpio_nums[0]  = LCD_DATA0;
        panelCfg.data_gpio_nums[1]  = LCD_DATA1;
        panelCfg.data_gpio_nums[2]  = LCD_DATA2;
        panelCfg.data_gpio_nums[3]  = LCD_DATA3;
        panelCfg.data_gpio_nums[4]  = LCD_DATA4;
        panelCfg.data_gpio_nums[5]  = LCD_DATA5;
        panelCfg.data_gpio_nums[6]  = LCD_DATA6;
        panelCfg.data_gpio_nums[7]  = LCD_DATA7;
        panelCfg.data_gpio_nums[8]  = LCD_DATA8;
        panelCfg.data_gpio_nums[9]  = LCD_DATA9;
        panelCfg.data_gpio_nums[10] = LCD_DATA10;
        panelCfg.data_gpio_nums[11] = LCD_DATA11;
        panelCfg.data_gpio_nums[12] = LCD_DATA12;
        panelCfg.data_gpio_nums[13] = LCD_DATA13;
        panelCfg.data_gpio_nums[14] = LCD_DATA14;
        panelCfg.data_gpio_nums[15] = LCD_DATA15;
        panelCfg.timings.pclk_hz          = LCD_PCLK_HZ;
        panelCfg.timings.h_res            = LCD_H_RES;
        panelCfg.timings.v_res            = LCD_V_RES;
        panelCfg.timings.hsync_pulse_width = LCD_HSYNC_PULSE_WIDTH;
        panelCfg.timings.hsync_back_porch  = LCD_HSYNC_BACK_PORCH;
        panelCfg.timings.hsync_front_porch = LCD_HSYNC_FRONT_PORCH;
        panelCfg.timings.vsync_pulse_width = LCD_VSYNC_PULSE_WIDTH;
        panelCfg.timings.vsync_back_porch  = LCD_VSYNC_BACK_PORCH;
        panelCfg.timings.vsync_front_porch = LCD_VSYNC_FRONT_PORCH;
        panelCfg.timings.flags.pclk_active_neg = 0;  // matches Seeed's verified Arduino
                                                     // reference (Arduino_GFX uses the
                                                     // default 0 for this panel).
        // DOUBLE FRAMEBUFFER (2×450 KB in PSRAM) for tear-free updates: LVGL draws
        // into the back FB and the driver swaps front/back on VSYNC, so the panel
        // never scans a half-drawn frame (no tearing/blur on NFT loads,
        // transitions, chart redraws). Paired below with LVGL direct_mode (redraw
        // only the CHANGED area) so a static screen is NOT repainted every frame —
        // that combination is Espressif's "double buffer + direct mode" anti-tear
        // mode. (An earlier num_fbs=2 + LVGL full_refresh build redrew the whole
        // 480×480 every ~30 ms and flickered like a CRT; direct_mode fixes that
        // while keeping the tear-free swap.)
        panelCfg.num_fbs           = 2;
        panelCfg.flags.fb_in_psram = 1;
        // Bounce buffer: the panel is fed from a small internal-SRAM bounce buffer
        // the driver DMA-refills from PSRAM, decoupling scanout from PSRAM bandwidth
        // spikes. Rock-steady because platformio.ini's custom_sdkconfig recompiles
        // esp_lcd from source (Hybrid Compile) with LCD_RGB_ISR_IRAM_SAFE +
        // LCD_RGB_RESTART_IN_VSYNC + PSRAM XIP (RESTART_IN_VSYNC fixed the shift).
        panelCfg.bounce_buffer_size_px = LCD_H_RES * 10;

