TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        // Create the panel. bounce + double-fb is ideal; if an IDF rejects the
        // combo, retry without the bounce buffer instead of boot-looping.
        esp_err_t lcdErr = esp_lcd_new_rgb_panel(&panelCfg, &_lcdPanel);
        if (lcdErr != ESP_OK && panelCfg.bounce_buffer_size_px != 0) {
            Log.printf("Display: RGB create failed w/ bounce+double_fb (%s) — retry no-bounce\n",
                       esp_err_to_name(lcdErr));
            panelCfg.bounce_buffer_size_px = 0;
            lcdErr = esp_lcd_new_rgb_panel(&panelCfg, &_lcdPanel);
        }
        ESP_ERROR_CHECK(lcdErr);
        ESP_ERROR_CHECK(esp_lcd_panel_reset(_lcdPanel));
        ESP_ERROR_CHECK(esp_lcd_panel_init(_lcdPanel));

        // VSYNC callback drives the tear-free handshake consumed by flush_cb.
        s_rgbVsyncSem = xSemaphoreCreateBinary();
        s_rgbGuiReady = xSemaphoreCreateBinary();
        esp_lcd_rgb_panel_event_callbacks_t rgbCbs = {};
        rgbCbs.on_vsync = rgbOnVsync;
        esp_lcd_rgb_panel_register_event_callbacks(_lcdPanel, &rgbCbs, nullptr);

        Log.printf("Display: RGB panel up — 2 FBs (direct-mode double-buffer), bounce=%d lines, IRAM-safe scanout\n",
                   (int)(panelCfg.bounce_buffer_size_px / LCD_H_RES));

        // 9. Register LVGL display driver in DIRECT MODE (double buffer).
        //    LVGL's two draw buffers ARE the panel's two PSRAM framebuffers. In
        //    direct_mode LVGL renders ONLY the changed areas into the back FB
        //    (it keeps both FBs in sync across frames), then flush swaps to it on
        //    VSYNC. Static screen → nothing invalidated → no redraw, no swap → NO
        //    flicker. NFT load / swipe → the changed region is drawn into the back
        //    FB and shown atomically on the swap → NO tearing. Best of both.
        void* fb0 = nullptr; void* fb1 = nullptr;
        ESP_ERROR_CHECK(esp_lcd_rgb_panel_get_frame_buffer(_lcdPanel, 2, &fb0, &fb1));
        // Clear both framebuffers to black — uninitialized PSRAM (often 0xFF = white)
        // would otherwise flash during the first big redraw or a screen swipe.
        memset(fb0, 0, (size_t)LCD_H_RES * LCD_V_RES * 2);
        memset(fb1, 0, (size_t)LCD_H_RES * LCD_V_RES * 2);
        static lv_disp_draw_buf_t drawBuf;
        lv_disp_draw_buf_init(&drawBuf, fb0, fb1, LCD_H_RES * LCD_V_RES);

        static lv_disp_drv_t dispDrv;
        lv_disp_drv_init(&dispDrv);
        dispDrv.hor_res     = LCD_H_RES;
        dispDrv.ver_res     = LCD_V_RES;
        dispDrv.draw_buf    = &drawBuf;
        dispDrv.user_data   = _lcdPanel;
        dispDrv.direct_mode = 1;    // redraw only changed areas into the 2 FBs
        dispDrv.flush_cb  = [](lv_disp_drv_t* drv, const lv_area_t* area, lv_color_t* colorP) {
            esp_lcd_panel_handle_t panel = static_cast<esp_lcd_panel_handle_t>(drv->user_data);
            // In direct_mode LVGL may call flush per dirty area; only the LAST call
            // of a refresh should swap the framebuffer. colorP points at the start
            // of the just-rendered full FB, so draw the WHOLE panel to make that FB
            // active (the swap).
            //
            // ORDER MATTERS (NFT marquee flicker fix): QUEUE the swap first, THEN
            // wait for a VSYNC. With bounce buffers the FB switch queued by
            // draw_bitmap only latches at a frame boundary, so the old order
            // (wait → queue → return) handed control back to LVGL while the panel
            // still scanned the OLD buffer for up to a full frame — and LVGL
            // immediately rendered the next animation step into that same buffer.
            // Continuously animated regions (the caption marquee on the NFT grid)
            // were therefore modified MID-SCAN on every tick → localized shimmer,
            // glaring on white artwork. Waiting AFTER the queue guarantees the
            // panel has started scanning the NEW buffer before LVGL touches the
            // old one. (Timeout, not portMAX, so a stalled VSYNC can't hard-freeze
            // the UI; pacing is unchanged — one blocking VSYNC wait per refresh.)
            if (lv_disp_flush_is_last(drv)) {
                esp_lcd_panel_draw_bitmap(panel, 0, 0, LCD_H_RES, LCD_V_RES, colorP);
                screenshot::setLiveFrame(colorP);   // /shot.bmp snapshots this FB
                if (s_rgbGuiReady && s_rgbVsyncSem) {
                    xSemaphoreGive(s_rgbGuiReady);
                    xSemaphoreTake(s_rgbVsyncSem, pdMS_TO_TICKS(60));
                }
            }
            lv_disp_flush_ready(drv);
        };
        lv_disp_drv_register(&dispDrv);
        // Paint the display background (behind all screens) black — LVGL defaults it
        // to white, which flashed through during the slide screen-swap animation.
        lv_disp_set_bg_color(lv_disp_get_default(), lv_color_black());
        screenshot::ensureShadow();

        // 10. Register LVGL touch input driver (FT6336U, polled — no INT pin).
        //     Reads 5 bytes from I2C 0x48: [touch_count, xH, xL, yH, yL].
        //     D/CX bits in xH[7:6] and yH[7:4] are masked out.
        //     If colors look mirrored, swap x/y or invert here to match the
        //     physical orientation (portrait, connector at bottom).
        static lv_indev_drv_t indevDrv;
        lv_indev_drv_init(&indevDrv);
        indevDrv.type      = LV_INDEV_TYPE_POINTER;
        indevDrv.user_data = this;   // so the lambda can reach _onTouchActivity()
        indevDrv.read_cb   = [](lv_indev_drv_t* drv, lv_indev_data_t* data) {
            Wire.beginTransmission(TOUCH_I2C_ADDR);
            Wire.write(0x02);  // TD_STATUS register: number of touch points
            Wire.endTransmission(false);
            Wire.requestFrom((uint8_t)TOUCH_I2C_ADDR, (uint8_t)5);
            if (Wire.available() >= 5) {
                uint8_t pts = Wire.read() & 0x0F;
                uint8_t xh  = Wire.read() & 0x0F;
                uint8_t xl  = Wire.read();
                uint8_t yh  = Wire.read() & 0x0F;
                uint8_t yl  = Wire.read();
                if (pts > 0) {
                    // The FT6336U is mounted rotated 180° vs the panel: touches
                    // landed at the diagonally-opposite point (tapping the top-left
                    // date opened the bottom-right gear's popup, etc.). Mirror BOTH
                    // X and Y so taps hit their targets and swipes go the right way.
                    lv_coord_t rawX = (lv_coord_t)((xh << 8) | xl);
                    lv_coord_t rawY = (lv_coord_t)((yh << 8) | yl);
                    data->point.x = (LCD_H_RES - 1) - rawX;
                    data->point.y = (LCD_V_RES - 1) - rawY;
                    data->state   = LV_INDEV_STATE_PRESSED;
                    // Swipe-vs-tap tracking: remember where the press began; once
                    // the finger travels past TAP_SLOP_PX, flag the gesture as a
                    // swipe so popup handlers ignore the trailing click.
                    UiManager* ui = static_cast<UiManager*>(drv->user_data);
                    if (!ui->_pressActive) {
                        ui->_pressActive   = true;
                        ui->_touchWasSwipe = false;
                        g_touchWasSwipe()  = false;
                        ui->_pressStartX   = data->point.x;
                        ui->_pressStartY   = data->point.y;
                    } else {
                        lv_coord_t dx = data->point.x - ui->_pressStartX;
                        lv_coord_t dy = data->point.y - ui->_pressStartY;
                        if (dx*dx + dy*dy > TAP_SLOP_PX*TAP_SLOP_PX) {
                            ui->_touchWasSwipe = true;
                            g_touchWasSwipe()  = true;   // mirror for out-of-UiManager handlers
                        }
                    }
                    // Any touch resets the inactivity timer (and wakes screen if off)
                    ui->_onTouchActivity();
                } else {
                    // Release: keep _touchWasSwipe intact so the CLICKED handler
                    // that fires right after can read it; clear the active flag so
                    // the next press starts a fresh gesture.
                    static_cast<UiManager*>(drv->user_data)->_pressActive = false;
                    data->state = LV_INDEV_STATE_RELEASED;
                }
            } else {
                static_cast<UiManager*>(drv->user_data)->_pressActive = false;
                data->state = LV_INDEV_STATE_RELEASED;
            }
        };
        lv_indev_drv_register(&indevDrv);

