TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        // 11. Enable backlight via LEDC PWM (GPIO 45, active HIGH).
        //     5 kHz / 8-bit resolution gives smooth dimming with no audible whine.
        //     Arduino-ESP32 3.x API: ledcAttach(pin, freq, bits) sets it up AND
        //     binds it in one call; PWM is then addressed by PIN, not channel
        //     (so every ledcWrite() below uses LCD_PIN_BL, not a channel index).
        ledcAttach(LCD_PIN_BL, 5000, 8);
        applyStoredBrightness();
    }

    void dismissAlarmOverlay() {
        if (_alarmBlinkTimer) { lv_timer_del(_alarmBlinkTimer); _alarmBlinkTimer = nullptr; }
        if (alarmOverlay) { lv_obj_del(alarmOverlay); alarmOverlay = nullptr; }
        _alarmBgText = _alarmStopBtn = _alarmStopLbl = nullptr;
        if (onAlarmDismissed) onAlarmDismissed();
    }

    void buildAllScreens() {
        screens[(int)ScreenId::CLOCK] = buildClockScreen();

        screens[(int)ScreenId::TURBO_STATS] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::TURBO_STATS], lv_color_black(), 0);
        turboScreen.build(screens[(int)ScreenId::TURBO_STATS], onLogoTapped, onDateTapped, onQrTapped, this);
        _wireAlarmIcon(turboScreen.header);
        _wireFooterNav(turboScreen.footer);
        turboScreen.setPickHandler(_onStatsTickerPick, this);   // footer picker → ticker search
        lv_timer_create(TurboScreen::pollLogo, 200, &turboScreen);

        screens[(int)ScreenId::DEBT] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::DEBT], lv_color_black(), 0);
        debtScreen.build(screens[(int)ScreenId::DEBT], onLogoTapped, onDateTapped, onQrTapped,
                          onDebtRangeTapped, onSinceBtnTapped, onRateBtnTapped, this);
        _wireAlarmIcon(debtScreen.header);
        _wireFooterNav(debtScreen.footer);

        screens[(int)ScreenId::INFLATION_GAME] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::INFLATION_GAME], lv_color_black(), 0);
        gameScreen.build(screens[(int)ScreenId::INFLATION_GAME], onLogoTapped, onDateTapped, onQrTapped, onGameYearsTapped, this);
        _wireAlarmIcon(gameScreen.header);
        _wireFooterNav(gameScreen.footer);

        screens[(int)ScreenId::NODE_NETWORK] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::NODE_NETWORK], lv_color_black(), 0);
        nodeScreen.build(screens[(int)ScreenId::NODE_NETWORK], onLogoTapped, onDateTapped, onQrTapped, onVerifyBadgeTapped, this);
        _wireAlarmIcon(nodeScreen.header);
        _wireFooterNav(nodeScreen.footer);

        screens[(int)ScreenId::NFT] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::NFT], lv_color_black(), 0);
        nftScreen.build(screens[(int)ScreenId::NFT], onLogoTapped, onDateTapped, onQrTapped, this);
        _wireAlarmIcon(nftScreen.header);
        _wireFooterNav(nftScreen.footer);

        screens[(int)ScreenId::TICKERS] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::TICKERS], lv_color_black(), 0);
        tickerScreen.build(screens[(int)ScreenId::TICKERS], onLogoTapped, onDateTapped, onQrTapped, this);
        // Market-cap alert fired → the SAME ringing experience as the wake-up
        // alarm (buzzer + flashing overlay), plus the trigger that tripped it
        // ("$CLAWD > $40M"). The overlay's STOP flow reuses onAlarmDismissed →
        // rp2040Link.stopAlarm(), and main.cpp's re-send loop keeps the buzzer
        // alive exactly like a wake-up ring.
        tickerScreen.onTickerAlarm = [this](const char* trigger) {
            rp2040Link.playAlarm(storage.getAlarmVolume());
            showAlarmFiringOverlay(trigger);
        };
        // NFT floor alerts ring the same TURBOALARM ("CRYPTOPUNKS > 35 ETH").
        nftScreen.onNftAlarm = [this](const char* trigger) {
            rp2040Link.playAlarm(storage.getAlarmVolume());
            showAlarmFiringOverlay(trigger);
        };
        _wireAlarmIcon(tickerScreen.header);
        _wireFooterNav(tickerScreen.footer);
        TickerScreen::s_instance = &tickerScreen;
        lv_timer_create(TickerScreen::pollPending, 100, &tickerScreen);

        attachSwipeGesture(screens[(int)ScreenId::CLOCK]);
        attachSwipeGesture(screens[(int)ScreenId::TURBO_STATS]);
        attachSwipeGesture(screens[(int)ScreenId::DEBT]);
        attachSwipeGesture(screens[(int)ScreenId::INFLATION_GAME]);
        attachSwipeGesture(screens[(int)ScreenId::NODE_NETWORK]);
        attachSwipeGesture(screens[(int)ScreenId::NFT]);
        attachSwipeGesture(screens[(int)ScreenId::TICKERS]);
    }

    // Footer navigation: tapping the node name/ID, the separator or the
    // "N NODES" counter jumps straight to the Network screen.
    void _wireFooterNav(SharedFooterRefs& ftr) {
        lv_obj_t* targets[3] = { ftr.nodeNameLabel, ftr.nodeSepLabel, ftr.nodeCountLabel };
        for (int i = 0; i < 3; i++) {
            if (!targets[i]) continue;
            lv_obj_add_flag(targets[i], LV_OBJ_FLAG_CLICKABLE);
            lv_obj_set_ext_click_area(targets[i], 8);   // small text → forgiving target
            lv_obj_add_event_cb(targets[i], [](lv_event_t* e) {
                UiManager* self = (UiManager*)lv_event_get_user_data(e);
                if (self && self->currentScreen != ScreenId::NODE_NETWORK)
                    self->showScreen(ScreenId::NODE_NETWORK);
            }, LV_EVENT_CLICKED, this);
        }
    }

    // Wire the alarm picker on a non-clock header after build().
    // NOTE: THIS is the wiring that actually runs — every screen calls
    // buildSharedHeader() WITHOUT its optional onAlarmTapped argument, so the
    // equivalent block inside shared_components.h is dead code. (That's why
    // earlier "make the time clickable / widen the bell halo" changes made
    // there never showed up on the device.)
    void _wireAlarmIcon(SharedHeaderRefs& hdr) {
        if (!hdr.alarmIcon) return;
        lv_obj_add_flag(hdr.alarmIcon, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_set_ext_click_area(hdr.alarmIcon, 14);   // was 6 — took several tries to hit
        lv_obj_add_event_cb(hdr.alarmIcon, onAlarmIconTapped, LV_EVENT_CLICKED, this);
        // The TIME opens the picker too — bell + time read as one cluster.
        if (hdr.timeLabel) {
            lv_obj_add_flag(hdr.timeLabel, LV_OBJ_FLAG_CLICKABLE);
            lv_obj_set_ext_click_area(hdr.timeLabel, 14);
            lv_obj_add_event_cb(hdr.timeLabel, onAlarmIconTapped, LV_EVENT_CLICKED, this);
        }
        // And ONE seamless tap target across the whole cluster (time + bell +
        // the gap between them): an invisible overlay created LAST, so it sits
        // on top and wins the hit-test — no dead spot in the middle.
        lv_obj_t* bar = lv_obj_get_parent(hdr.alarmIcon);
        if (bar) {
            lv_obj_t* touch = lv_obj_create(bar);
            lv_obj_set_size(touch, 78, 22);              // bar content height; ext pads the rest
            lv_obj_align(touch, LV_ALIGN_RIGHT_MID, 0, 0);
            lv_obj_set_style_bg_opa(touch, LV_OPA_0, 0);
            lv_obj_set_style_border_width(touch, 0, 0);
            lv_obj_clear_flag(touch, LV_OBJ_FLAG_SCROLLABLE);
            lv_obj_add_flag(touch, LV_OBJ_FLAG_CLICKABLE);
            lv_obj_set_ext_click_area(touch, 12);        // reach the bar's padding edges
            lv_obj_add_event_cb(touch, onAlarmIconTapped, LV_EVENT_CLICKED, this);
        }
    }

    lv_obj_t* buildClockScreen() {
        lv_obj_t* scr = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(scr, lv_color_black(), 0);

