TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        // Optional home background image + a translucent shadow behind the
        // clock/alarm cluster so text stays legible over a busy image. Created
        // FIRST so they sit BEHIND the clock widgets (z-order = creation order).
        // Both hidden until a background URL is set and downloaded (_pollHomeBg).
        _homeBgImg = lv_img_create(scr);
        lv_obj_set_size(_homeBgImg, 480, 480);
        lv_obj_align(_homeBgImg, LV_ALIGN_TOP_MID, 0, 0);
        lv_obj_clear_flag(_homeBgImg, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_add_flag(_homeBgImg, LV_OBJ_FLAG_HIDDEN);

        // Legibility over a background image is handled PER ELEMENT (a subtle
        // rounded plate + soft shadow behind the date, the time and the alarm),
        // toggled by _setHomePlates() when a background is applied — NOT one big
        // panel over the whole cluster.

        LV_IMG_DECLARE(turbousd_logo);
        lv_obj_t* logo = lv_img_create(scr);
        lv_img_set_src(logo, &turbousd_logo);
        lv_img_set_zoom(logo, 170);   // ~32px
        lv_obj_align(logo, LV_ALIGN_TOP_MID, 0, 10);

        // Date — larger, letter-spaced; tap opens the calendar.
        clockDateLabel = lv_label_create(scr);
        lv_obj_set_style_text_color(clockDateLabel, lv_color_hex(0xcfcfd4), 0);
        lv_obj_set_style_text_font(clockDateLabel, &lv_font_montserrat_20, 0);
        lv_obj_set_style_text_letter_space(clockDateLabel, 3, 0);
        lv_obj_align(clockDateLabel, LV_ALIGN_CENTER, 0, -84);
        lv_obj_add_flag(clockDateLabel, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_set_ext_click_area(clockDateLabel, 12);
        lv_obj_add_event_cb(clockDateLabel, onDateTapped, LV_EVENT_CLICKED, this);

        // Time — big custom Montserrat font.
        clockTimeLabel = lv_label_create(scr);
        lv_obj_set_style_text_color(clockTimeLabel, lv_color_hex(0x3aff7a), 0);
        lv_obj_set_style_text_font(clockTimeLabel, &montserrat_clock, 0);
        lv_obj_align(clockTimeLabel, LV_ALIGN_CENTER, 0, -6);

        // Alarm — rounded pill; colour (border + text) follows the alarm state,
        // set each second in updateClockIfNeeded (yellow = on, grey = off).
        clockAlarmLabel = lv_label_create(scr);
        lv_obj_set_style_text_font(clockAlarmLabel, &lv_font_montserrat_20, 0);
        lv_obj_set_style_text_color(clockAlarmLabel, lv_color_hex(0x6e7280), 0);
        lv_obj_set_style_radius(clockAlarmLabel, 16, 0);
        lv_obj_set_style_border_width(clockAlarmLabel, 2, 0);
        lv_obj_set_style_border_color(clockAlarmLabel, lv_color_hex(0x6e7280), 0);
        lv_obj_set_style_pad_hor(clockAlarmLabel, 16, 0);
        lv_obj_set_style_pad_ver(clockAlarmLabel, 7, 0);
        lv_obj_align(clockAlarmLabel, LV_ALIGN_CENTER, 0, 78);
        lv_obj_add_flag(clockAlarmLabel, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_set_ext_click_area(clockAlarmLabel, 10);
        lv_obj_add_event_cb(clockAlarmLabel, onAlarmLabelTapped, LV_EVENT_CLICKED, this);

        // Ambient temp/humidity line, e.g. "23° · 48%" (from the RP2040 AHT20).
        clockWeatherLabel = lv_label_create(scr);
        lv_obj_set_style_text_color(clockWeatherLabel, lv_color_hex(0x9a9a9e), 0);
        lv_obj_set_style_text_font(clockWeatherLabel, &lv_font_montserrat_16, 0);
        lv_obj_align(clockWeatherLabel, LV_ALIGN_CENTER, 0, 64);
        lv_label_set_text(clockWeatherLabel, "--\xC2\xB0 \xE2\x80\xA2 --%");
        lv_obj_add_flag(clockWeatherLabel, LV_OBJ_FLAG_HIDDEN);  // hidden per design; code kept

        clockFooterRefs = buildSharedFooter(scr, onQrTapped, this);
        _wireFooterNav(clockFooterRefs);

        return scr;
    }

    void updateClockIfNeeded() {
        time_t now = time(nullptr);
        struct tm t;
        localtime_r(&now, &t);  // local wall-clock (tz offset set via configTime/geo)
        if ((uint32_t)t.tm_sec == lastClockRedrawSecond) return;
        lastClockRedrawSecond = t.tm_sec;

        // Refresh alarm-bell icons on every non-clock header once per second.
        bool alarmOn    = storage.getAlarmEnabled();
        bool todayOn    = storage.isAlarmActiveToday(t.tm_wday);
        refreshSharedAlarmIcon(turboScreen.header,  alarmOn, todayOn);
        refreshSharedAlarmIcon(debtScreen.header,   alarmOn, todayOn);
        refreshSharedAlarmIcon(gameScreen.header,   alarmOn, todayOn);
        refreshSharedAlarmIcon(nodeScreen.header,   alarmOn, todayOn);
        refreshSharedAlarmIcon(tickerScreen.header, alarmOn, todayOn);
        refreshSharedAlarmIcon(nftScreen.header,    alarmOn, todayOn);

        // Refresh the date/time/temp/humidity text in every non-clock header.
        // (Previously nothing called this, so those headers showed no clock and
        // the temp/humidity labels stayed blank.) Temp/humidity come from the
        // RP2040 AHT20 poll; when there's no valid reading they render as "--".
        bool is24h      = storage.getTimeFormat() == "24H";
        char tempUnit   = storage.getTempUnit();
        refreshSharedHeader(turboScreen.header,  t, _tempC, _humidityPct, is24h, tempUnit, _sensorValid);
        refreshSharedHeader(debtScreen.header,   t, _tempC, _humidityPct, is24h, tempUnit, _sensorValid);
        refreshSharedHeader(gameScreen.header,   t, _tempC, _humidityPct, is24h, tempUnit, _sensorValid);
        refreshSharedHeader(nodeScreen.header,   t, _tempC, _humidityPct, is24h, tempUnit, _sensorValid);
        refreshSharedHeader(tickerScreen.header, t, _tempC, _humidityPct, is24h, tempUnit, _sensorValid);
        refreshSharedHeader(nftScreen.header,    t, _tempC, _humidityPct, is24h, tempUnit, _sensorValid);

        // Refresh every footer (node name/code + "| N NODES"). Prefer the
        // DISPLAY NAME (synced from the backend on each heartbeat); fall back
        // to the node code, then to a placeholder for unregistered devices.
        String footerName = storage.getDisplayName();
        if (footerName.length() == 0) footerName = storage.getNodeCode();
        if (footerName.length() == 0) footerName = "NEW NODE";
        refreshSharedFooter(clockFooterRefs,     footerName, _onlineNodeCount);
        refreshSharedFooter(turboScreen.footer,  footerName, _onlineNodeCount);
        refreshSharedFooter(debtScreen.footer,   footerName, _onlineNodeCount);
        refreshSharedFooter(gameScreen.footer,   footerName, _onlineNodeCount);
        refreshSharedFooter(nodeScreen.footer,   footerName, _onlineNodeCount);
        refreshSharedFooter(tickerScreen.footer, footerName, _onlineNodeCount);
        refreshSharedFooter(nftScreen.footer,    footerName, _onlineNodeCount);

        // Tick the SINCE/RATE figures once per second: SINCE keeps growing
        // with elapsed time (visibly for NODE ON, whose value is shown in $k
        // with two decimals precisely so the climb is watchable live).
        if (_debtHistLoaded) _computeDebtDerived();

        // Debounced debt-range refetch (set by the range picker's live-apply).
        if (_debtRangeDirty) {
            _debtRangeDirty = false;
            static const int yearValues[] = {5, 10, 20, 30, 50, 75};
            reloadDebtHistory(yearValues[debtYearsRangeIndex % 6]);
        }

        // Real-time inflation game: tick once per second while visible.
        if (currentScreen == ScreenId::INFLATION_GAME && _gameRtActive)
            _tickGameRealtime();

