TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        lv_obj_add_event_cb(cancelBtn, [](lv_event_t*) {
            closeModal(sCard);
        }, LV_EVENT_CLICKED, nullptr);

        lv_obj_add_event_cb(installBtn, [](lv_event_t*) {
            closeModal(sCard);
            // Show a "Downloading..." label before handing off to main.cpp.
            // Kept in a member so otaFailed() can tear it down if the download
            // fails (a 404 etc.) — otherwise it stayed on screen forever.
            lv_obj_t* splash = lv_obj_create(lv_layer_top());
            sSelf->_otaSplash = splash;
            lv_obj_set_size(splash, LV_PCT(100), LV_PCT(100));
            lv_obj_set_style_bg_color(splash, lv_color_hex(0x000000), 0);
            lv_obj_center(splash);
            lv_obj_t* dlLabel = lv_label_create(splash);
            lv_label_set_text(dlLabel,
                "Updating firmware\n\n"
                "Downloading and installing...\n"
                "This takes about 30 seconds.\n\n"
                "The screen may look frozen -\n"
                "that's normal. Do NOT turn off.\n"
                "The device restarts when done.");
            lv_obj_set_style_text_align(dlLabel, LV_TEXT_ALIGN_CENTER, 0);
            lv_obj_set_style_text_color(dlLabel, lv_color_hex(0x3aff7a), 0);
            lv_obj_center(dlLabel);
            // Do NOT paint or start the download HERE: this callback runs INSIDE
            // lv_timer_handler(), so a nested lv_timer_handler() is a no-op (LVGL
            // ignores re-entrant calls) — that's why the splash never showed and
            // the screen just froze on the old frame. Defer to loop() (runs
            // OUTSIDE the handler): it paints the splash for a few frames, THEN
            // kicks off the blocking download.
            sSelf->_otaInstallPending = true;
        }, LV_EVENT_CLICKED, nullptr);
    }

public:
    // Splash shown while the OTA image downloads (see the install button above).
    lv_obj_t* _otaSplash = nullptr;
    // Changelog for the pending OTA release (shown by the dialog's "What's new").
    char _otaNotes[512] = {};
    // Set by the install button; consumed in loop() to paint the splash before
    // the blocking download (the button can't paint — it runs inside the handler).
    bool _otaInstallPending = false;

    // main.cpp calls this when applyPendingUpdate() fails. WITHOUT it the
    // "Downloading update... Do not turn off" splash stayed up forever, so the
    // user thought it was still downloading when it had actually failed. Tear
    // the splash down and show a clear, dismissable error instead.
    void otaFailed(const char* reason = nullptr) {
        if (_otaSplash) { lv_obj_del(_otaSplash); _otaSplash = nullptr; }
        lv_obj_t* ov = lv_obj_create(lv_layer_top());
        lv_obj_set_size(ov, LV_PCT(100), LV_PCT(100));
        lv_obj_set_style_bg_color(ov, lv_color_hex(0x000000), 0);
        lv_obj_set_style_bg_opa(ov, LV_OPA_COVER, 0);
        lv_obj_add_flag(ov, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_t* l = lv_label_create(ov);
        char msg[192];
        snprintf(msg, sizeof(msg),
                 "Update failed.\n\n%s\n\nYour device is unchanged and still\nrunning the current version.\n\nTap to dismiss.",
                 (reason && reason[0]) ? reason : "The download did not complete.");
        lv_label_set_text(l, msg);
        lv_obj_set_style_text_align(l, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_set_style_text_color(l, lv_color_hex(0xff6b6b), 0);
        lv_obj_center(l);
        lv_obj_add_event_cb(ov, [](lv_event_t* e) {
            lv_obj_del(lv_event_get_current_target(e));
        }, LV_EVENT_CLICKED, nullptr);
        lv_timer_handler();   // paint it immediately
    }

private:
    static void onAlarmLabelTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openAlarmPicker(); }
    static void onAlarmIconTapped(lv_event_t* e)  { ((UiManager*)lv_event_get_user_data(e))->openAlarmPicker(); }
    static void onLogoTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->showScreen(ScreenId::CLOCK); }
    static void onDateTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openCalendarPopup(); }
    static void onQrTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openConfigPopup(); }
    static void onDebtRangeTapped(lv_event_t* e) {
        UiManager* self = (UiManager*)lv_event_get_user_data(e);
        self->debtYearsRangeIndex = (int)lv_dropdown_get_selected(lv_event_get_current_target(e));
        self->_debtRangeDirty = true;   // deferred 1-2 s refetch (updateClockIfNeeded)
    }
    static void onSinceBtnTapped(lv_event_t* e) {
        UiManager* self = (UiManager*)lv_event_get_user_data(e);
        self->sincePeriodIndex = (int)lv_dropdown_get_selected(lv_event_get_current_target(e));
        self->_computeDebtDerived();
    }
    static void onRateBtnTapped(lv_event_t* e) {
        UiManager* self = (UiManager*)lv_event_get_user_data(e);
        self->rateUnitIndex = (int)lv_dropdown_get_selected(lv_event_get_current_target(e));
        self->_computeDebtDerived();
    }
    static void onGameYearsTapped(lv_event_t* e) {
        UiManager* self = (UiManager*)lv_event_get_user_data(e);
        self->gameYearsIndex = (int)lv_dropdown_get_selected(lv_event_get_current_target(e));
        self->_updateGameProjection();
    }
    static void onVerifyBadgeTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openVerifyTooltip(); }

    void openAlarmPicker() {
        if (_touchWasSwipe) return;   // a swipe that started on the bell — not a tap
        lv_obj_t* card = openModal(lv_scr_act());

        lv_obj_t* title = lv_label_create(card);
        lv_label_set_text(title, "SET ALARM");
        lv_obj_set_style_text_color(title, lv_color_hex(0x9a9a9e), 0);

        // ── Day-of-week selector strip ────────────────────────────────────────
        // Layout: 7 squares (32×32) with 4px gap, centred.
        // Display order follows the week-start setting (auto-set from geo-IP,
        // user-overridable): 0 = Sunday first, 1 = Monday first.
        // Storage bitmask: bit0=Mon, bit1=Tue, …, bit6=Sun (ISO).
        // dayOrder[display_pos] = bitmask_bit_index
        bool sunFirst = (storage.getWeekStart() == 0);

        // Display order of bitmask-bit indices
        static const uint8_t dayOrderMon[7] = { 0, 1, 2, 3, 4, 5, 6 }; // Mon…Sun
        static const uint8_t dayOrderSun[7] = { 6, 0, 1, 2, 3, 4, 5 }; // Sun Mon…Sat
        const uint8_t* dayOrder = sunFirst ? dayOrderSun : dayOrderMon;

